app/controllers/tasks_controller.rb

  def index
    @tasks = (Task.all).sort_by do |task|
---
SELECT "tasks".* FROM "tasks"

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    task = Task.new(action: params[:task][:action], description: params[:task][:description], completion_date:  params[:task][:completion_date]) #instantiate a new book

    successful_save = task.save

    if successful_save # save returns true if the database insert succeeds
      redirect_to root_path # go to the index so we can see the book in the list
    else # save failed :(
      render :new # show the new book form view again
    end
  end

  def edit
    @task = Task.find_by(id: params[:id])
  end

  def update
    task = Task.find_by(id: params[:id])

    task.update(task_params)

    is_successful = task.save

    if is_successful # save returns true if the database insert succeeds
      redirect_to tasks_path(task.id) # go to the index so we can see the book in the list
    else # save failed :(
      render :new # show the new book form view again
    end
  end

  def destroy
    task = Task.find_by(id: params[:id])

    task.destroy

    redirect_to tasks_path(task.id)
  end

  def complete
    task = Task.find(params[:id])

    if task.mark_complete == "Mark Complete"
      task.update_attributes(:mark_complete => "Unmark Complete", :completion_date => Date.today)
    else
      task.update_attribute(:mark_complete, "Mark Complete")
    end
     redirect_to tasks_path(task.id)
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at", "completion_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "birthday party at Christal's"], ["updated_at", "2018-09-22 01:03:02.388883"], ["id", 5]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
UPDATE "tasks" SET "mark_complete" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["mark_complete", "Mark Complete"], ["updated_at", "2018-09-23 23:34:06.359206"], ["id", 1]]
UPDATE "tasks" SET "mark_complete" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["mark_complete", "Mark Complete"], ["updated_at", "2018-09-23 23:52:51.095498"], ["id", 1]]